
### :robot: Terraform Report
---
##### Plan: `146` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.amilcar_permissions["roles/aiplatform.admin"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/aiplatform.admin"
    }

  # google_project_iam_member.amilcar_permissions["roles/aiplatform.user"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/aiplatform.user"
    }

  # google_project_iam_member.amilcar_permissions["roles/bigquery.connectionUser"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.connectionUser"
    }

  # google_project_iam_member.amilcar_permissions["roles/bigquery.dataViewer"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.amilcar_permissions["roles/bigquery.jobUser"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.jobUser"
    }

  # google_project_iam_member.amilcar_permissions["roles/bigquery.studioUser"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.studioUser"
    }

  # google_project_iam_member.amilcar_permissions["roles/bigquery.user"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.user"
    }

  # google_project_iam_member.amilcar_permissions["roles/compute.instanceAdmin"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/compute.instanceAdmin"
    }

  # google_project_iam_member.amilcar_permissions["roles/dataflow.admin"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/dataflow.admin"
    }

  # google_project_iam_member.amilcar_permissions["roles/dataproc.admin"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/dataproc.admin"
    }

  # google_project_iam_member.amilcar_permissions["roles/datastore.owner"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/datastore.owner"
    }

  # google_project_iam_member.amilcar_permissions["roles/datastore.user"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/datastore.user"
    }

  # google_project_iam_member.amilcar_permissions["roles/editor"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/editor"
    }

  # google_project_iam_member.amilcar_permissions["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # google_project_iam_member.amilcar_permissions["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_project_iam_member.amilcar_permissions["roles/iam.serviceAccountViewer"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/iam.serviceAccountViewer"
    }

  # google_project_iam_member.amilcar_permissions["roles/livestream.editor"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/livestream.editor"
    }

  # google_project_iam_member.amilcar_permissions["roles/logging.admin"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/logging.admin"
    }

  # google_project_iam_member.amilcar_permissions["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.amilcar_permissions["roles/monitoring.editor"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/monitoring.editor"
    }

  # google_project_iam_member.amilcar_permissions["roles/run.developer"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/run.developer"
    }

  # google_project_iam_member.amilcar_permissions["roles/run.invoker"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/run.invoker"
    }

  # google_project_iam_member.amilcar_permissions["roles/run.sourceViewer"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/run.sourceViewer"
    }

  # google_project_iam_member.amilcar_permissions["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.amilcar_permissions["roles/serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # google_project_iam_member.amilcar_permissions["roles/speech.client"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/speech.client"
    }

  # google_project_iam_member.amilcar_permissions["roles/storage.admin"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/storage.admin"
    }

  # google_project_iam_member.amilcar_permissions["roles/storage.objectUser"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/storage.objectUser"
    }

  # google_project_iam_member.amilcar_permissions["roles/transcoder.admin"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/transcoder.admin"
    }

  # google_project_iam_member.amilcar_permissions["roles/vpcaccess.user"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/vpcaccess.user"
    }

  # google_project_iam_member.amilcar_permissions["roles/workflows.admin"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/workflows.admin"
    }

  # google_project_iam_member.amilcar_permissions["roles/workflows.invoker"] will be created
  + resource "google_project_iam_member" "amilcar_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:amilcar.infante@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/workflows.invoker"
    }

  # google_project_iam_member.backend_sa_project_access["roles/datastore.user"] will be created
  + resource "google_project_iam_member" "backend_sa_project_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "maestro-intelligence"
      + role    = "roles/datastore.user"
    }

  # google_project_iam_member.backend_sa_project_access["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "backend_sa_project_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "maestro-intelligence"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.backend_sa_project_access["roles/storage.objectUser"] will be created
  + resource "google_project_iam_member" "backend_sa_project_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "maestro-intelligence"
      + role    = "roles/storage.objectUser"
    }

  # google_project_iam_member.backend_sa_project_access["roles/storage.objectViewer"] will be created
  + resource "google_project_iam_member" "backend_sa_project_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "maestro-intelligence"
      + role    = "roles/storage.objectViewer"
    }

  # google_project_iam_member.federico_permissions["roles/aiplatform.admin"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/aiplatform.admin"
    }

  # google_project_iam_member.federico_permissions["roles/aiplatform.user"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/aiplatform.user"
    }

  # google_project_iam_member.federico_permissions["roles/bigquery.connectionUser"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.connectionUser"
    }

  # google_project_iam_member.federico_permissions["roles/bigquery.dataViewer"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.federico_permissions["roles/bigquery.jobUser"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.jobUser"
    }

  # google_project_iam_member.federico_permissions["roles/bigquery.studioUser"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.studioUser"
    }

  # google_project_iam_member.federico_permissions["roles/bigquery.user"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.user"
    }

  # google_project_iam_member.federico_permissions["roles/compute.instanceAdmin"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/compute.instanceAdmin"
    }

  # google_project_iam_member.federico_permissions["roles/dataflow.admin"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/dataflow.admin"
    }

  # google_project_iam_member.federico_permissions["roles/dataproc.admin"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/dataproc.admin"
    }

  # google_project_iam_member.federico_permissions["roles/datastore.owner"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/datastore.owner"
    }

  # google_project_iam_member.federico_permissions["roles/datastore.user"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/datastore.user"
    }

  # google_project_iam_member.federico_permissions["roles/editor"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/editor"
    }

  # google_project_iam_member.federico_permissions["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # google_project_iam_member.federico_permissions["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_project_iam_member.federico_permissions["roles/iam.serviceAccountViewer"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/iam.serviceAccountViewer"
    }

  # google_project_iam_member.federico_permissions["roles/livestream.editor"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/livestream.editor"
    }

  # google_project_iam_member.federico_permissions["roles/logging.admin"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/logging.admin"
    }

  # google_project_iam_member.federico_permissions["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.federico_permissions["roles/monitoring.editor"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/monitoring.editor"
    }

  # google_project_iam_member.federico_permissions["roles/run.developer"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/run.developer"
    }

  # google_project_iam_member.federico_permissions["roles/run.invoker"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/run.invoker"
    }

  # google_project_iam_member.federico_permissions["roles/run.sourceViewer"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/run.sourceViewer"
    }

  # google_project_iam_member.federico_permissions["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.federico_permissions["roles/serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # google_project_iam_member.federico_permissions["roles/speech.client"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/speech.client"
    }

  # google_project_iam_member.federico_permissions["roles/storage.admin"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/storage.admin"
    }

  # google_project_iam_member.federico_permissions["roles/storage.objectUser"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/storage.objectUser"
    }

  # google_project_iam_member.federico_permissions["roles/transcoder.admin"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/transcoder.admin"
    }

  # google_project_iam_member.federico_permissions["roles/vpcaccess.user"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/vpcaccess.user"
    }

  # google_project_iam_member.federico_permissions["roles/workflows.admin"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/workflows.admin"
    }

  # google_project_iam_member.federico_permissions["roles/workflows.invoker"] will be created
  + resource "google_project_iam_member" "federico_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:federico.acien@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/workflows.invoker"
    }

  # google_project_iam_member.felipe_permissions["roles/aiplatform.admin"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/aiplatform.admin"
    }

  # google_project_iam_member.felipe_permissions["roles/aiplatform.user"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/aiplatform.user"
    }

  # google_project_iam_member.felipe_permissions["roles/bigquery.connectionUser"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.connectionUser"
    }

  # google_project_iam_member.felipe_permissions["roles/bigquery.dataViewer"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.felipe_permissions["roles/bigquery.jobUser"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.jobUser"
    }

  # google_project_iam_member.felipe_permissions["roles/bigquery.studioUser"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.studioUser"
    }

  # google_project_iam_member.felipe_permissions["roles/bigquery.user"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.user"
    }

  # google_project_iam_member.felipe_permissions["roles/compute.instanceAdmin"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/compute.instanceAdmin"
    }

  # google_project_iam_member.felipe_permissions["roles/dataflow.admin"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/dataflow.admin"
    }

  # google_project_iam_member.felipe_permissions["roles/dataproc.admin"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/dataproc.admin"
    }

  # google_project_iam_member.felipe_permissions["roles/datastore.owner"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/datastore.owner"
    }

  # google_project_iam_member.felipe_permissions["roles/datastore.user"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/datastore.user"
    }

  # google_project_iam_member.felipe_permissions["roles/editor"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/editor"
    }

  # google_project_iam_member.felipe_permissions["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # google_project_iam_member.felipe_permissions["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_project_iam_member.felipe_permissions["roles/iam.serviceAccountViewer"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/iam.serviceAccountViewer"
    }

  # google_project_iam_member.felipe_permissions["roles/livestream.editor"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/livestream.editor"
    }

  # google_project_iam_member.felipe_permissions["roles/logging.admin"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/logging.admin"
    }

  # google_project_iam_member.felipe_permissions["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.felipe_permissions["roles/monitoring.editor"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/monitoring.editor"
    }

  # google_project_iam_member.felipe_permissions["roles/run.developer"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/run.developer"
    }

  # google_project_iam_member.felipe_permissions["roles/run.invoker"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/run.invoker"
    }

  # google_project_iam_member.felipe_permissions["roles/run.sourceViewer"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/run.sourceViewer"
    }

  # google_project_iam_member.felipe_permissions["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.felipe_permissions["roles/serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # google_project_iam_member.felipe_permissions["roles/speech.client"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/speech.client"
    }

  # google_project_iam_member.felipe_permissions["roles/storage.admin"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/storage.admin"
    }

  # google_project_iam_member.felipe_permissions["roles/storage.objectUser"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/storage.objectUser"
    }

  # google_project_iam_member.felipe_permissions["roles/transcoder.admin"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/transcoder.admin"
    }

  # google_project_iam_member.felipe_permissions["roles/vpcaccess.user"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/vpcaccess.user"
    }

  # google_project_iam_member.felipe_permissions["roles/workflows.admin"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/workflows.admin"
    }

  # google_project_iam_member.felipe_permissions["roles/workflows.invoker"] will be created
  + resource "google_project_iam_member" "felipe_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/workflows.invoker"
    }

  # google_project_iam_member.felipe_redis will be created
  + resource "google_project_iam_member" "felipe_redis" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:felipe.bozzano@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/redis.editor"
    }

  # google_project_iam_member.ilan_permissions["roles/aiplatform.admin"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/aiplatform.admin"
    }

  # google_project_iam_member.ilan_permissions["roles/aiplatform.user"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/aiplatform.user"
    }

  # google_project_iam_member.ilan_permissions["roles/bigquery.connectionUser"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.connectionUser"
    }

  # google_project_iam_member.ilan_permissions["roles/bigquery.dataViewer"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.ilan_permissions["roles/bigquery.jobUser"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.jobUser"
    }

  # google_project_iam_member.ilan_permissions["roles/bigquery.studioUser"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.studioUser"
    }

  # google_project_iam_member.ilan_permissions["roles/bigquery.user"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/bigquery.user"
    }

  # google_project_iam_member.ilan_permissions["roles/compute.instanceAdmin"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/compute.instanceAdmin"
    }

  # google_project_iam_member.ilan_permissions["roles/dataflow.admin"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/dataflow.admin"
    }

  # google_project_iam_member.ilan_permissions["roles/dataproc.admin"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/dataproc.admin"
    }

  # google_project_iam_member.ilan_permissions["roles/datastore.owner"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/datastore.owner"
    }

  # google_project_iam_member.ilan_permissions["roles/datastore.user"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/datastore.user"
    }

  # google_project_iam_member.ilan_permissions["roles/editor"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/editor"
    }

  # google_project_iam_member.ilan_permissions["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # google_project_iam_member.ilan_permissions["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_project_iam_member.ilan_permissions["roles/iam.serviceAccountViewer"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/iam.serviceAccountViewer"
    }

  # google_project_iam_member.ilan_permissions["roles/livestream.editor"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/livestream.editor"
    }

  # google_project_iam_member.ilan_permissions["roles/logging.admin"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/logging.admin"
    }

  # google_project_iam_member.ilan_permissions["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.ilan_permissions["roles/monitoring.editor"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/monitoring.editor"
    }

  # google_project_iam_member.ilan_permissions["roles/run.developer"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/run.developer"
    }

  # google_project_iam_member.ilan_permissions["roles/run.invoker"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/run.invoker"
    }

  # google_project_iam_member.ilan_permissions["roles/run.sourceViewer"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/run.sourceViewer"
    }

  # google_project_iam_member.ilan_permissions["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.ilan_permissions["roles/serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # google_project_iam_member.ilan_permissions["roles/speech.client"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/speech.client"
    }

  # google_project_iam_member.ilan_permissions["roles/storage.admin"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/storage.admin"
    }

  # google_project_iam_member.ilan_permissions["roles/storage.objectUser"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/storage.objectUser"
    }

  # google_project_iam_member.ilan_permissions["roles/transcoder.admin"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/transcoder.admin"
    }

  # google_project_iam_member.ilan_permissions["roles/vpcaccess.user"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/vpcaccess.user"
    }

  # google_project_iam_member.ilan_permissions["roles/workflows.admin"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/workflows.admin"
    }

  # google_project_iam_member.ilan_permissions["roles/workflows.invoker"] will be created
  + resource "google_project_iam_member" "ilan_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:ilan.rosenfeld@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/workflows.invoker"
    }

  # google_project_iam_member.lili_permissions["roles/storage.objectUser"] will be created
  + resource "google_project_iam_member" "lili_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:lmario.mauvecin@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/storage.objectUser"
    }

  # google_project_iam_member.lili_permissions["roles/storage.objectViewer"] will be created
  + resource "google_project_iam_member" "lili_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:lmario.mauvecin@globant.com"
      + project = "maestro-intelligence"
      + role    = "roles/storage.objectViewer"
    }

  # google_service_account.backend_sa will be created
  + resource "google_service_account" "backend_sa" {
      + account_id   = "maestro-backend"
      + disabled     = false
      + display_name = "Service Account for Backend server"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "maestro-intelligence"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.backend_admin_group["user:amilcar.infante@globant.com"] will be created
  + resource "google_service_account_iam_member" "backend_admin_group" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "user:amilcar.infante@globant.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.backend_admin_group["user:federico.acien@globant.com"] will be created
  + resource "google_service_account_iam_member" "backend_admin_group" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "user:federico.acien@globant.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.backend_admin_group["user:felipe.bozzano@globant.com"] will be created
  + resource "google_service_account_iam_member" "backend_admin_group" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "user:felipe.bozzano@globant.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.backend_admin_group["user:manuel.aller@globant.com"] will be created
  + resource "google_service_account_iam_member" "backend_admin_group" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "user:manuel.aller@globant.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.backend_admin_group["user:mario.mauvecin@globant.com"] will be created
  + resource "google_service_account_iam_member" "backend_admin_group" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "user:mario.mauvecin@globant.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.backend_sa_self["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_member" "backend_sa_self" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.backend_sa_self["roles/iam.serviceAccountUser"] will be created
  + resource "google_service_account_iam_member" "backend_sa_self" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_storage_bucket.maestro_backend_overlays will be created
  + resource "google_storage_bucket" "maestro_backend_overlays" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "maestro_backend_overlays"
      + project                     = "maestro-intelligence"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket_iam_member.maestro_backend_overlays_iam["user:mariana.nievas@globant.com"] will be created
  + resource "google_storage_bucket_iam_member" "maestro_backend_overlays_iam" {
      + bucket = "maestro_backend_overlays"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:mariana.nievas@globant.com"
      + role   = "roles/storage.objectViewer"
    }

  # google_storage_bucket_iam_member.maestro_backend_overlays_iam["user:mario.mauvecin@globant.com"] will be created
  + resource "google_storage_bucket_iam_member" "maestro_backend_overlays_iam" {
      + bucket = "maestro_backend_overlays"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:mario.mauvecin@globant.com"
      + role   = "roles/storage.objectViewer"
    }

Plan: 146 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#12181189568`](https://github.com/lessthan3/personalization/actions/runs/12181189568) - commit 221fbcf2874e5153c4b77922759bec67dc5e8315
